Let's learn more about pandas! Let's load the appropriate library
# Initialize

In [55]:
import pandas as pd
import numpy as np

<font color='red'>To-do:</font> Load nfl_football_profiles.json to pandas df named nfl

In [56]:
nfl = pd.read_json('nfl_football_profiles.json')
nfl.head()

,player_id,name,position,height,weight,current_team,birth_date,birth_place,death_date,college,high_school,draft_team,draft_round,draft_position,draft_year,current_salary,hof_induction_year
0,1809,Robert Blackmon,DB,6-0,208.0,None,1967-05-12,"Bay City, TX",None,Baylor,"Van Vleck, TX",Seattle Seahawks,2.0,34.0,1990.0,None,NaN
1,23586,Dean Wells,LB,6-3,248.0,None,1970-07-20,"Louisville, KY",None,Kentucky,"Holy Cross, KY",Seattle Seahawks,4.0,85.0,1993.0,None,NaN
2,355,Kiko Alonso,ILB,6-3,238.0,Miami Dolphins,1990-08-14,"Newton, MA",None,Oregon,"Los Gatos, CA",Buffalo Bills,2.0,46.0,2013.0,"1,075,000",NaN
3,18182,Steve Ramsey,QB,6-2,210.0,None,1948-04-22,"Dallas, TX",1999-10-15,North Texas,"W.W. Samuell, TX",New Orleans Saints,5.0,126.0,1970.0,None,NaN
4,16250,Cory Nelms,CB,6-0,195.0,None,1988-02-27,"Neptune, NJ",None,Miami (FL),"Neptune, NJ",None,NaN,NaN,NaN,None,NaN

Lets clean up the data:
Let's remove all the commas in the current_salary column in a new column called salary

In [57]:
nfl['salary'] = nfl['current_salary'].str.replace(',', '')

Let's clean this up further by converting the data type to a float

In [58]:
nfl['salary'] = nfl['salary'].astype(float)

In [59]:
nfl['salary'].head(10)

0          NaN
1          NaN
2    1075000.0
3          NaN
4          NaN
5          NaN
6    1762000.0
7          NaN
8          NaN
9          NaN
Name: salary, dtype: float64

<font color='red'>To-do:</font> Remove all NaN values in salary from the nfl df into a new df called nfl_salary_cleaned

In [60]:
nfl_salary_cleaned = nfl.dropna(subset=['salary'])
nfl_salary_cleaned.head()

,player_id,name,position,height,weight,current_team,birth_date,birth_place,death_date,college,high_school,draft_team,draft_round,draft_position,draft_year,current_salary,hof_induction_year,salary
2,355,Kiko Alonso,ILB,6-3,238.0,Miami Dolphins,1990-08-14,"Newton, MA",None,Oregon,"Los Gatos, CA",Buffalo Bills,2.0,46.0,2013.0,"1,075,000",NaN,1075000.0
6,2701,Preston Brown,ILB,6-1,251.0,Buffalo Bills,1992-10-27,"Cincinnati, OH",None,Louisville,"Northwest, OH",Buffalo Bills,3.0,73.0,2014.0,"1,762,000",NaN,1762000.0
13,3966,Frank Clark,DE,6-2,270.0,Seattle Seahawks,1993-06-14,"Cleveland, OH",None,Michigan,"Glenville, OH",Seattle Seahawks,2.0,63.0,2015.0,"774,294",NaN,774294.0
37,19449,Emmanuel Sanders,WR,5-11,186.0,Denver Broncos,1987-03-16,"Bellville, TX",None,SMU,"Bellville, TX",Pittsburgh Steelers,3.0,82.0,2010.0,"6,750,000",NaN,6750000.0
53,17858,Bilal Powell,RB,5-11,204.0,New York Jets,1988-10-27,"Lakeland, FL",None,Louisville,"Lake Gibson, FL",New York Jets,4.0,126.0,2011.0,"3,750,000",NaN,3750000.0

# Dummy variables and discretizing salaries

<font color='red'>To-do:</font> Using the same NFL dataset, lets discretize the salaries. Let's create bins by splitting salaries into five equally sized groups (hint: use pd.Series.quantiles and np.linspace)

In [61]:
bins = nfl['salary'].quantile(q=[0, 0.2, 0.4, 0.6, 0.8, 1], interpolation='linear')
bins

0.0       38294.0
0.2      465000.0
0.4      615000.0
0.6      800000.0
0.8     1797000.0
1.0    23943600.0
Name: salary, dtype: float64

Using these bins that we set, we can set labels to them and have them categorized by that bin by using pd.cut()

In [62]:
pd.cut(nfl_salary_cleaned['salary'],bins,labels=['d0','d2','d4','d6','d8'])[0:10]

2      d6
6      d6
13     d4
37     d8
53     d8
57     d6
90     d2
106    d8
113    d0
114    d8
Name: salary, dtype: category
Categories (5, object): ['d0' < 'd2' < 'd4' < 'd6' < 'd8']

Similarly, we can create dummy variables to categorize our labels and bins into an organized dataframe by using pd.get_dummies(). It will display whether a player fits into our labels based on their salary bin range.

In [63]:
dummy_variable = pd.get_dummies(pd.cut(nfl_salary_cleaned['salary'],bins,labels=['d0','d2','d4','d6','d8']))

In [64]:
dummy_variable.head()

    d0  d2  d4  d6  d8
2    0   0   0   1   0
6    0   0   0   1   0
13   0   0   1   0   0
37   0   0   0   0   1
53   0   0   0   0   1

# Joining and Merging Datasets

Let's create some simple dataframes

In [65]:
drinks1 = pd.DataFrame({'Drinks': ['Coca-Cola', 'Sprite', 'Fanta', 'Root-Beer', 'Dr. Pepper'],
                   'Prices': [0.99, 1.49, 1.99, 2.49, 5],
                   'id': ['D01', 'D02', 'D03', 'D04', 'D05']})

In [66]:
drinks1.head()

       Drinks  Prices   id
0   Coca-Cola    0.99  D01
1      Sprite    1.49  D02
2       Fanta    1.99  D03
3   Root-Beer    2.49  D04
4  Dr. Pepper    5.00  D05

In [67]:
drinks2 = pd.DataFrame({'Drinks': ['Squirt', 'Ginger-Ale', 'Cream-Soda', 'Pepsi'],
                   'Prices': [0.49, 0.99, 1.99, 1.49],
                   'id': ['D06', 'D07', 'D08', 'D09']})

In [68]:
drinks2.head()

       Drinks  Prices   id
0      Squirt    0.49  D06
1  Ginger-Ale    0.99  D07
2  Cream-Soda    1.99  D08
3       Pepsi    1.49  D09

<font color='red'>To-do:</font> Concatenate drinks1 and drinks2 on rows, but ignore indexes. Show all 9 rows on the df

In [69]:
pd.concat([drinks1, drinks2], ignore_index = True)

       Drinks  Prices   id
0   Coca-Cola    0.99  D01
1      Sprite    1.49  D02
2       Fanta    1.99  D03
3   Root-Beer    2.49  D04
4  Dr. Pepper    5.00  D05
5      Squirt    0.49  D06
6  Ginger-Ale    0.99  D07
7  Cream-Soda    1.99  D08
8       Pepsi    1.49  D09

Now let's practice joining tables. Load in title.ratings.tsv and title.basics.tsv. <font color='red'>These files are included in the zipped file you downloaded with your lab instructions. </font>

In [70]:
ratings = pd.read_csv('title.ratings.tsv', sep='\t')

In [71]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.6      1646
1  tt0000002            6.1       198
2  tt0000003            6.5      1345
3  tt0000004            6.2       120
4  tt0000005            6.1      2131

In [72]:
titles = pd.read_csv('title.basics.tsv', sep='\t')

/Users/xuruge/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3146: DtypeWarning: Columns (5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [73]:
titles.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

Notice that on titles and ratings, tconst is the same. We can therefore join these two dataframe using that column as index.

<font color='red'>To-do:</font> Merge ratings and titles in a dataframe called imdb_info on tconst. In a markdown cell, explain what kind of join this is and why you chose to use it.

In [74]:
imdb_info = ratings.merge(titles, on = 'tconst')
imdb_info.head()

,tconst,averageRating,numVotes,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,5.6,1646,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,6.1,198,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,6.5,1345,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,6.2,120,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,6.1,2131,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

pandas.merge uses a default inner join. This takes only the intersection of two dataframes on 'tconst'. I choose this kind of join because it will only select the rows that are not NaN for both dataframes.

<font color='red'>To-do:</font> In a markdown cell, explain the difference between an inner join, outer join, right join, and left join.

Left join means all the values from the "left" side are used, whether or not there's a corresponding entry from the "right" side. Right join means all the values from the "right" side are used, whether or not a corresponding value from the "left" side exists. Outer joins include values from both the "left" and "right" DataFrames, regardless of whether there are corresponding values in the other DataFrame. Inner joins include only those values that exist in both the "left" and "right" DataFrames.

<font color='red'>To-do:</font> What is the difference between pd.concat and pd.merge?

pd.merge: used to combine two or more dataframes on the basis of values of common columns or row-indices. pd.concat: used to append one or more dataframes below the other or sideways after aligning on indices.

# Exploding, manipulation and grouping practice, YAY!

Let's look at the genres in our imdb_info df. Use explode function to create a row per genre, title pair. (Similar to Q14 in HW1). There also appears to be '\N' tacked onto each of the cells. Let's also get rid of that.

In [75]:
imdb_info.genres = imdb_info.genres.str.extract(r'([a-zA-Z,]*)')
imdb_info.loc[:,"genre_list"] = imdb_info.apply(lambda x: str(x["genres"]).split(","),axis=1)
df_genre = imdb_info.explode("genre_list")
df_genre.rename(columns={'genre_list':'genre'}, inplace=True)

In [76]:
imdb_info.head()

,tconst,averageRating,numVotes,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genre_list
0,tt0000001,5.6,1646,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short","[Documentary, Short]"
1,tt0000002,6.1,198,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short","[Animation, Short]"
2,tt0000003,6.5,1345,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance","[Animation, Comedy, Romance]"
3,tt0000004,6.2,120,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short","[Animation, Short]"
4,tt0000005,6.1,2131,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short","[Comedy, Short]"

Looking at runtimeMinutes, we see that its type is object.

In [77]:
df_genre['runtimeMinutes'].head()

0    1
0    1
1    5
1    5
2    4
Name: runtimeMinutes, dtype: object

We want to fix the data up a bit more. There appears to be '\\N' tacked onto the end of runtimeMinutes. Let's just grab the number in each of the cells by using some regex

<font color='red'>To-do:</font> Extract the numeric values from the runtimeMinutes column. (HINT: use .str.extract())

In [78]:
df_genre.runtimeMinutes = df_genre.runtimeMinutes.str.extract(r'([0-9.]*)')
df_genre['runtimeMinutes'].head()

0    1
0    1
1    5
1    5
2    4
Name: runtimeMinutes, dtype: object

<font color='red'>To-do:</font> Change the object dtype of runtimeMinutes to float.

In [79]:
df_genre.loc[:,"runtimeMinutes"] = pd.to_numeric(df_genre['runtimeMinutes'])
df_genre['runtimeMinutes'].head()

0    1.0
0    1.0
1    5.0
1    5.0
2    4.0
Name: runtimeMinutes, dtype: float64

Let's practice using some groupby on the dataset. Let's look at the df by grouping by the average rating

In [80]:
df_genre.groupby('averageRating').sum()

               numVotes  isAdult  runtimeMinutes
averageRating
1.0              208524        4         26444.0
1.1               34632        9         11054.0
1.2               37745        9         14083.0
1.3              133439        9         15836.0
1.4              250526        3         17615.0
...                 ...      ...             ...
9.6             2590258       44         82023.0
9.7             2603109       17         43255.0
9.8             1293387       35         40721.0
9.9             2526855       11         14948.0
10.0             403865       40         21242.0

[91 rows x 3 columns]

<font color='red'>To-do:</font> Find the average number of votes for averageRating for each genre. Find the first quartile.

In [81]:
df_genre.groupby(['genre', 'averageRating']).mean()['numVotes']

genre    averageRating
         1.0              21.318182
         1.1              43.333333
         1.2              39.454545
         1.3              36.080000
         1.4              36.880000
                            ...
Western  9.6               8.714286
         9.7               6.000000
         9.8               5.333333
nan      8.0               5.000000
         8.2               5.000000
Name: numVotes, Length: 2579, dtype: float64

In [82]:
df_genre.groupby(['averageRating','genres']).quantile(q=0.25)['numVotes']

averageRating  genres
1.0                                            8.25
               Action,Adventure               12.00
               Action,Adventure,Animation      6.00
               Action,Adventure,Crime        313.00
               Action,Adventure,Horror        24.00
                                              ...
10.0           Short,Thriller                  5.00
               Short,War                       8.00
               Sport                          10.00
               Talk                            7.00
               Thriller                        5.75
Name: numVotes, Length: 44906, dtype: float64

<font color='red'>To-do:</font> What is the total number of votes for each genre, for each start year? (hint - use groupby)

In [83]:
df_genre.groupby(['startYear', 'genre']).sum()['numVotes']

startYear  genre
1892       Animation    1663
           Comedy       1345
           Romance      1345
           Short         318
1893       Comedy       2131
                        ...
\N         Short         179
           Sport         100
           Talk           37
           Thriller      725
           nan            10
Name: numVotes, Length: 4903, dtype: int64

# Analysis on Child Opportunity Index

Now let's analyse the child opportunity dataset from the lecture with the tools we've learnt today. But, first let's load the Child Opportunity Index json file from the lecture. Column descriptions can be found at this [link](https://data.diversitydatakids.org/dataset/coi20-child-opportunity-index-2-0-database/resource/f16fff12-b1e5-4f60-85d3-3a0ededa30a0)

In [84]:
opportunity = pd.read_json('raw.json')

<font color='red'>To-do:</font>  Create a dataframe that shows the min, average and maximum median household income in census tracts that belong to a top 100 metropolitan area and those that don't (hint: use groupby and apply to do this)

In [85]:
df_groupbyin100 = opportunity.groupby('in100')['SE_MHE']
df_min = df_groupbyin100.apply(lambda x: np.min(x))
df_avg = df_groupbyin100.apply(lambda x: np.mean(x))
df_max = df_groupbyin100.apply(lambda x: np.max(x))
pd.concat([df_min, df_avg, df_max], axis=1)

       SE_MHE        SE_MHE    SE_MHE
in100
0.0    2499.0  51280.497588  254394.0
1.0    2499.0  67220.144778  266907.0

<font color='red'>To-do:</font> Create a a new column in the dataframe by bucketing the median household income into 4 equal sized in terms of number of rows groups (hint use pd.Series.quantile function) "low_mhe","low-medium_mhe", "high-medium_mhe", and "high_mhe".

In [86]:
bins = opportunity['SE_MHE'].quantile(q=[0, 0.25, 0.5, 0.75, 1], interpolation='linear')
opportunity['SE_MHE_bucket'] = pd.cut(opportunity['SE_MHE'],bins,labels=['low_mhe','low-median_mhe','high-median_mhe','high_mhe'])
opportunity

,geoid,year,in100,msaid15,msaname15,countyfips,statefips,stateusps,pop,ED_APENR,...,HE_RSEI,SE_POVRATE,SE_PUBLIC,SE_HOME,SE_OCC,SE_MHE,SE_EMPRAT,SE_JOBPROX,SE_SINGLE,SE_MHE_bucket
0,1001020100,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,424,0.349463,...,5.933720,9.240363,14.398734,84.335442,27.972027,60321.0,68.187744,5.224787,17.256638,high-median_mhe
1,1001020100,2015,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,414,0.252991,...,7.015026,10.677506,12.068965,75.198936,38.479000,67826.0,82.987556,1.052632,26.556019,high-median_mhe
2,1001020200,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,497,0.350239,...,6.083863,10.511090,13.028169,58.568073,40.000000,44039.0,59.521217,1.727862,48.818897,low-median_mhe
3,1001020200,2015,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,508,0.253207,...,7.306938,22.413794,24.137930,61.941254,30.516430,41287.0,60.339661,0.931315,47.470818,low-median_mhe
4,1001020300,2010,0.0,33860.0,"Montgomery, AL Metro Area",1001,1,AL,878,0.349768,...,6.162114,11.823454,9.035088,76.315788,31.036932,46002.0,82.875099,1.788375,31.969309,low-median_mhe
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
146107,56043000302,2015,NaN,NaN,None,56043,56,WY,706,0.221675,...,5.326058,14.899487,8.024072,76.028084,32.825882,52214.0,70.059875,7.700206,12.012987,low-median_mhe
146108,56045951100,2010,NaN,NaN,None,56045,56,WY,638,0.000000,...,1.225840,10.197711,3.453947,80.838814,26.534653,68768.0,70.643524,31.721613,25.000000,high-median_mhe
146109,56045951100,2015,NaN,NaN,None,56045,56,WY,577,0.192535,...,0.469633,12.532808,4.201102,78.925621,32.217308,62435.0,73.387695,23.780487,33.514984,high-median_mhe
146110,56045951300,2010,NaN,NaN,None,56045,56,WY,954,0.000000,...,4.060935,16.489092,5.855339,77.324913,25.696268,50070.0,84.599152,17.847338,35.205181,low-median_mhe
146111,56045951300,2015,NaN,NaN,None,56045,56,WY,922,0.000000,...,3.086356,15.929919,8.381503,74.624275,31.743422,54074.0,82.461784,17.639902,33.479214,low-median_mhe

<font color='red'>To-do:</font> Now create a table such that the index corresponds to whether a census tract belongs to top 100 metropolitan area, the columns correspond to the median household income bucket and the values correspond to average third-grade math proficiency. As a challenge, consider what you may be able say about (i) the relationship between household income and math proficiency of children as a whole and (ii) how this relationship differs between big cities and elsewehere?

In [87]:
opportunity.pivot_table(index='in100',columns='SE_MHE_bucket',values='ED_MATH',aggfunc=np.mean)

SE_MHE_bucket     low_mhe  low-median_mhe  high-median_mhe    high_mhe
in100
0.0            205.024781      220.900619       229.021845  242.240327
1.0            177.554489      205.821513       224.600362  257.436952

(i) From the table above, I conclude that the higher the household income, the higher the math proficiency of children.

(ii) The gap in math proficiency of children between families with different incomes is even more pronounced in big cities.